In [7]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
import numpy as np
## open the CSV file
datapath="../data/raw/VisitorsToUK.csv"
visitors = pd.read_csv(datapath)
#countries = sorted(population['Country Name'].unique())
#countries=['United Kingdom','United States']

In [8]:
visitors

      Quarter  Number
0     1986 Q1    3477
1     1986 Q2    3349
2     1986 Q3    3557
3     1986 Q4    3514
4     1987 Q1    3674
..        ...     ...
483  2016 MAR    3080
484  2016 APR    2960
485  2016 MAY    3040
486  2016 JUN    2990
487  2016 JUL    3070

[488 rows x 2 columns]

In [10]:
date=visitors['Quarter']
num=visitors['Number']
#type(country_data)
#country_data.head()

In [11]:
date

0       1986 Q1
1       1986 Q2
2       1986 Q3
3       1986 Q4
4       1987 Q1
         ...
483    2016 MAR
484    2016 APR
485    2016 MAY
486    2016 JUN
487    2016 JUL
Name: Quarter, Length: 488, dtype: object

In [ ]:
Chart_Title = "Visitors to UK"

fig = plt.figure(figsize=(12,8))
ax = fig.add_axes([0, 0, 1, 1])
ax.set_title(Chart_Title)
ax.grid(False)
ax.yaxis.grid(True)



ax.plot(date, num, linewidth="2", marker='o')